_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 200, 200, 16)      1312      
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 200, 200, 16)      0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 200, 200, 16)      0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 66, 66, 16)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 66, 66, 16)        6416      
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 66, 66, 16)        0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 66, 66, 16)        0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 22, 22, 16)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 22, 22, 32)        4640      
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 22, 22, 32)        0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 5, 5, 32)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 800)               0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 800)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               102528    
_________________________________________________________________
dropout_4 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                4128      
_________________________________________________________________
dropout_5 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 33        
=================================================================
Total params: 119,057
Trainable params: 119,057
Non-trainable params: 0
_________________________________________________________________
